Revit 2024 API
Connector.AssignedPipeFlowConfiguration Property
The pipe flow configuration type of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PipeFlowConfigurationType AssignedPipeFlowConfiguration { get; }
Visual Basic
Public ReadOnly Property AssignedPipeFlowConfiguration As PipeFlowConfigurationType
	Get
Visual C++
public:
property PipeFlowConfigurationType AssignedPipeFlowConfiguration {
	PipeFlowConfigurationType get ();
}
Remarks
Assigned pipe flow configuration may be assigned for connectors of some family instances.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown on failure to get pipe flow configuration.
See Also
Connector Class
Autodesk.Revit.DB Namespace